NordicPlayground/nrf5-ble-docomo-linking/examples/ble_peripheral/experimental_ble_app_linking_temp/main.c
static void pdsis_timeout_handler(void * p_context)
{
    int32_t  i_temp;
    
    // Read SoC temperature
    uint32_t err_code = sd_temp_get(&i_temp);
    if (err_code == NRF_SUCCESS)
    {
        ble_pdsis_notify_value_t value;
        ble_pdls_t * p_pdls   = (ble_pdls_t *)p_context;
        uint16_t u_temp       = IEEE754_Convert_Temperature((float)i_temp*0.25f);
        value.originaldata[0] = (uint32_t)u_temp;
        
        ble_pdls_pdsis_notify(p_pdls, PDSIS_SENSOR_TYPE_TEMPERATURE, &value);
    }
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    // Create timers.
    uint32_t err_code = app_timer_create(&m_pdsis_notify_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                pdsis_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
            break;
        default:
            break;
    }
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    ble_uuid_t adv_uuids[] = {{PDLS_UUID_SERVICE, m_pdls.uuid_type}};

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = adv_uuids;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

static ble_pdls_result_code_t pdsis_event_handler(ble_pdls_t * p_pdls, ble_pdsis_event_data_t *p_pdsis_event)
{
    uint32_t err_code;
    bool status = p_pdsis_event->status;

    switch (p_pdsis_event->event)
    {
        case PDSIS_EVT_SET_NOTIFY_INFO:
          if (p_pdsis_event->type == PDSIS_SENSOR_TYPE_TEMPERATURE)
          {
            if (status == PDSIS_STATUS_ON)
            {
                // Start timer to send temperature notification
                err_code = app_timer_start(m_pdsis_notify_timer_id, PDSIS_NOTIFY_INTERVAL, (void *)p_pdls);
            }
            else if (status == PDSIS_STATUS_OFF)
            {
                // Start timer to send temperature notification
                err_code = app_timer_stop(m_pdsis_notify_timer_id);
            }
            else
            {
                err_code = NRF_ERROR_INVALID_PARAM;
            }
            // send handling result back to PDLP
            if (err_code != NRF_SUCCESS)
            {
              return PDLS_RESULT_ERROR_FAILED;
            }
            else
            {
              return PDLS_RESULT_OK;
            }
          }
          else
          {
            return PDLS_RESULT_ERROR_NOT_SUPPORT;
          }

        case PDSIS_EVT_GET_SENSOR_INFO:
        {
          if (p_pdsis_event->type == PDSIS_SENSOR_TYPE_TEMPERATURE)
          {
            int32_t  i_temp;
            uint16_t u_temp;
            
            // Read SoC temperature
            err_code = sd_temp_get(&i_temp);
            if (err_code != NRF_SUCCESS)
            {
              return PDLS_RESULT_ERROR_FAILED;
            }
            // Encode in DoCoMo format
            u_temp = IEEE754_Convert_Temperature((float)i_temp*0.25f);
            p_pdsis_event->data.originaldata[0] = (uint32_t)u_temp;
            return PDLS_RESULT_OK;
          }
          else
          {
            return PDLS_RESULT_ERROR_NOT_SUPPORT;
          }
        }

        default:
          return PDLS_RESULT_ERROR_NOT_SUPPORT;
    } 
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t        err_code;
    ble_pdls_init_t init;

    //PDPIS
    init.servicelist          = PDPIS_SERVICE_BITMASK_PIS | PDPIS_SERVICE_BITMASK_SIS;
    init.deviceid             = 0xABCD;     // any data
    init.deviceuid            = 0xAABBCCDD; // any data
    init.devicecapability     = PDPIS_CAPABILITY_BITMASK_HASLED;
    //PDNS
    init.notifycategory       = PDNS_NOTIFY_CATEGORY_NOTNOTIFY;
    //PDSIS
    init.sensortypes          = PDSIS_SENSOR_BITMASK_TEMPERATURE;
    init.pdsis_event_handler  = pdsis_event_handler;
  
